# CircleLightShape Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CircleLightShape Constructor
CircleLightShape Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CircleLightShape()()()() | Creates a circle light shape object with 2.0' emit diameter. |
| CircleLightShape(Double) | Creates a circle light shape object with the given emit diameter. |
| CircleLightShape(CircleLightShape) | Creates a copy of the given circle light shape |

# See Also
CircleLightShape Class
CircleLightShape Members
Autodesk.Revit.DB.Lighting Namespace